{
    "version": "https://jsonfeed.org/version/1",
    "title": "eliasvsimon.com",
    "home_page_url": "https://eliasvsimon.com/",
    "feed_url": "https://eliasvsimon.com/feed.json",
    "description": "A blog about development and other stuff",
    "icon": "https://eliasvsimon.com/favicon-32x32.png",
    "author": {
        "name": "Elias Vincent Simon",
        "url": "https://eliasvsimon.com"
    },
    "items": [
        {
            "id": "https://eliasvsimon.com/post/1765580400",
            "content_html": "<p>On the side I've been working on <strong>SNOTES</strong>, a simple desktop note-taking application built with Tauri and SQLite. It's been a while since the last update and I wanted to show a bit of progress.</p>\n<p><img src=\"/images/16.png\" title=\"SNOTES\" alt=\"SNOTES\"></p>\n<p>SNOTES is all about simplicity and speed. No bloat, no BS - just quickly create, paste, tag and search notes. It's built with Tauri as the frontend framework and uses SQLite as the storage backend, which means it's lightweight and blazing fast.</p>\n<p>It's not the most complex thing from a software development standpoint: everything fits inside a ~1000 line vanilla TypeScript file, but it actually turned out to be quite useful to me.</p>\n<p>Some highlights:</p>\n<ul>\n<li><strong>Free</strong> - SNOTES is free software</li>\n<li><strong>Simple</strong> - Create and manage your notes with a simple and intuitive interface</li>\n<li><strong>Fast</strong> - Everything from startup to search is lightning fast</li>\n<li><strong>OCR</strong> - Use Optical Character Recognition to extract text from image files</li>\n<li><strong>Export</strong> - Export your notes in various formats such as TXT or Markdown</li>\n</ul>\n<p>If you're tired of overcomplicated note apps and just want something that works, give SNOTES a try.</p>\n<p><a href=\"https://snotes.maidsin.space/\">Check it out and download here</a></p>",
            "url": "https://eliasvsimon.com/post/1765580400",
            "title": "SNOTES - A Simple Desktop Note-Taking App\r",
            "summary": "\r\nOn the side I've been working on **SNOTES**, a simple desktop note-taking application built with",
            "image": "https://eliasvsimon.com/favicon-32x32.png",
            "date_modified": "2025-12-12T23:00:00.000Z",
            "author": {
                "name": "Elias\r",
                "url": "https://eliasvsimon.com"
            }
        },
        {
            "id": "https://eliasvsimon.com/post/1696284000",
            "content_html": "<p>Me, <a href=\"https://twitter.com/SoulPixelIV\">SoulPixelIV</a>, <a href=\"https://twitter.com/ProtoKrok\">ProtoKrok</a> and <a href=\"https://twitter.com/DervlX\">DervlX</a> made a game for the <a href=\"https://ldjam.com\">Ludum Dare 54 Gamejam</a>.</p>\n<p>Welcome to the unveiling of the successor to Machina-Machination’s popular X-12 manned indoor combat mech!</p>\n<p>The X-13 is but a prototype, and is not yet proven for real-world use. This is where you come in.</p>\n<p>As our best combat pilot, awarded with the medal of honor, you’ve been pulled out of retirement for one last mission. Investors will take a close look at your performance.</p>\n<p>Give them a show to remember, this weapon might change the future of warfare.</p>\n<p><a href=\"https://ldjam.com/events/ludum-dare/54/x-13-virtuous-mission\">RATE THE GAME</a></p>\n<iframe frameborder=\"0\" src=\"https://itch.io/embed/2295231?bg_color=201800&amp;fg_color=ffffff&amp;link_color=bd8600&amp;border_color=3e3800\" width=\"208\" height=\"167\"><a href=\"https://riesyeti.itch.io/x-13-virtuous-mission\">X-13 VIRTUOUS MISSION by Riesyeti</a></iframe>",
            "url": "https://eliasvsimon.com/post/1696284000",
            "title": "X-13 VIRTUOUS MISSION - Cool Mech Game for Ludum Dare 54\r",
            "summary": "\r\nMe, [SoulPixelIV](https://twitter.com/SoulPixelIV), [ProtoKrok](https://twitter.com/ProtoKrok) and [DervlX](https://twitter.com/DervlX) made a game for the [Ludum Dare 54 Gamejam](https://ldjam.com).\r\n\r\nWelcome to",
            "image": "https://eliasvsimon.com/favicon-32x32.png",
            "date_modified": "2023-10-02T22:00:00.000Z",
            "author": {
                "name": "Elias\r",
                "url": "https://eliasvsimon.com"
            }
        },
        {
            "id": "https://eliasvsimon.com/post/1681077600",
            "content_html": "<p>Have you ever wanted to chat with a powerful language model on your own device, without relying on cloud services or internet connection? If so, you might be interested in Vicunia!</p>\n<p><img src=\"/images/14.png\" title=\"Vicunia\" alt=\"Vicunia\"></p>\n<p>Alpaca.cpp is a project that allows you to run a fast ChatGPT-like model locally on your device. It combines the LLaMA foundation model with an open reproduction of Stanford Alpaca, a fine-tuning of the base model to act like ChatGPT and a set of modifications to llama.cpp to add a chat interface. Alpaca.cpp can run on Windows, Linux and macOS, and requires only 4GB of weights.</p>\n<p>What is Vicunia?</p>\n<p>Vicunia is a frontend for using alpaca.cpp and providing a GUI for installing and chatting with Stanford Alpaca. It is built with React.js, Next.js and Nextron. Vicunia aims to make it easy download and use models like Alpaca, without having to deal with CLI tools or complicated setup steps, which is how most local machine learning things are right now. Vicunia also offers some features such as emoji support, options menu for all parameters and exporting your chat history.</p>\n<p><a href=\"https://github.com/EliasVincent/vicunia\">Try it out here</a></p>",
            "url": "https://eliasvsimon.com/post/1681077600",
            "title": "Vicunia - A chat GUI for local language models\r",
            "summary": "\r\nHave you ever wanted to chat with a powerful language model on your own device,",
            "image": "https://eliasvsimon.com/favicon-32x32.png",
            "date_modified": "2023-04-09T22:00:00.000Z",
            "author": {
                "name": "Elias\r",
                "url": "https://eliasvsimon.com"
            }
        },
        {
            "id": "https://eliasvsimon.com/post/1678143600",
            "content_html": "<p>Have you ever wanted to have transcribed or translated subtitles for a video? Do you feel like YouTube's auto-subtitles suck?</p>\n<p>Whisper-Subtitles-WebUI is a gradio frontend for OpenAI Whisper that allows you to generate subtitles for videos. You can choose the output format of the subtitles, such as SRT or embedded into a new video file and download them. You can also translate the speech in the video from other languages to English, if you enable the translation option. It's all running locally on your own hardware.</p>\n<p><img src=\"/images/13.png\" title=\"Whisper-Subtitles-WebUI\" alt=\"Whisper-Subtitles-WebUI\"></p>\n<p>To use this, you need python and about 5GB+ of free space. <a href=\"https://github.com/openai/whisper#available-models-and-languages\">Your hardware dictates how large of a model you can run</a>. </p>\n<p><a href=\"https://github.com/EliasVincent/whisper-subtitles-webui\">Get it here</a></p>",
            "url": "https://eliasvsimon.com/post/1678143600",
            "title": "Whisper-Subtitles-WebUI - An AI tool for generating and translating subtitles\r",
            "summary": "\r\nHave you ever wanted to have transcribed or translated subtitles for a video? Do you",
            "image": "https://eliasvsimon.com/favicon-32x32.png",
            "date_modified": "2023-03-06T23:00:00.000Z",
            "author": {
                "name": "Elias\r",
                "url": "https://eliasvsimon.com"
            }
        },
        {
            "id": "https://eliasvsimon.com/post/1673391600",
            "content_html": "<p>Hello there again, haven't posted in a while here :D</p>\n<p>I have done a bunch of things in the meantime, working on some projects and stuff but I haven't really \"published\" a project in almost a year. To get back in the swing I made a small game for the Ludum Dare 52 Gamejam.</p>\n<iframe src=\"https://itch.io/embed/1869264?bg_color=553700&amp;fg_color=ffffff&amp;link_color=fa5c5c&amp;border_color=444444\" width=\"208\" height=\"167\" frameborder=\"0\"><a href=\"https://riesyeti.itch.io/cat-crop-collector\">Cat Crop Collector by Riesyeti</a></iframe>\n<p>Harvest weird crops while fending off foes with your anti-monster spray!</p>\n<p>It was also a great opportunity to test out Godot 4, which is still in Beta right now.</p>\n<p><a href=\"https://ldjam.com/events/ludum-dare/52/cat-crop-collector\">Rate the game</a></p>\n<p>Check it out on itch above, or the <a href=\"https://github.com/EliasVincent/ld52-game\">source on Github</a></p>",
            "url": "https://eliasvsimon.com/post/1673391600",
            "title": "Cat Crop Collector - Game for Ludum Dare 52\r",
            "summary": "\r\nHello there again, haven't posted in a while here :D\r\n\r\nI have done a bunch of",
            "image": "https://eliasvsimon.com/favicon-32x32.png",
            "date_modified": "2023-01-10T23:00:00.000Z",
            "author": {
                "name": "Elias\r",
                "url": "https://eliasvsimon.com"
            }
        },
        {
            "id": "https://eliasvsimon.com/post/1651269600",
            "content_html": "<p>Again I participated in a Gamejam together with SoulPixel. The game is called <strong>Hell: Retaliation</strong></p>\n<iframe src=\"https://itch.io/embed/1500520?dark=true\" width=\"208\" height=\"167\" frameborder=\"0\"><a href=\"https://riesyeti.itch.io/hell-retaliation\">Hell: Retaliation by Riesyeti</a></iframe>\n<p>It's a Bullet-Hell game but your only attack is parrying.</p>\n<p>Parry the Bullet by pressing Parry while the bullet being in the white circle around you and you being in the same color. Those bullets will fly towards the enemy!</p>\n<p>Check it out on itch above, or the <a href=\"https://github.com/EliasVincent/bullet-hell-jam-2022\">source on Github</a></p>",
            "url": "https://eliasvsimon.com/post/1651269600",
            "title": "Hell Retaliation - A new Godot Bullet-Hell Gamejam game!\r",
            "summary": "\r\nAgain I participated in a Gamejam together with SoulPixel. The game is called **Hell: Retaliation**\r\n\r\n<iframe",
            "image": "https://eliasvsimon.com/favicon-32x32.png",
            "date_modified": "2022-04-29T22:00:00.000Z",
            "author": {
                "name": "Elias\r",
                "url": "https://eliasvsimon.com"
            }
        },
        {
            "id": "https://eliasvsimon.com/post/1649455200",
            "content_html": "<p>In Elden Ring it's kinda hard to see how many runes each Great Rune in your inventory gives and how many you will get combined, so I made this handy little calculator.</p>\n<p><img src=\"/images/10.gif\" title=\"Elden Ring Rune Calculator\" alt=\"Elden Ring Rune Calculator\"></p>\n<p>The site can be found here: <a href=\"https://eliasvincent.github.io/elden-ring-rune-calculator/\">https://eliasvincent.github.io/elden-ring-rune-calculator/</a></p>",
            "url": "https://eliasvsimon.com/post/1649455200",
            "title": "A Rune Calculator for Elden Ring\r",
            "summary": "\r\nIn Elden Ring it's kinda hard to see how many runes each Great Rune in",
            "image": "https://eliasvsimon.com/favicon-32x32.png",
            "date_modified": "2022-04-08T22:00:00.000Z",
            "author": {
                "name": "Elias\r",
                "url": "https://eliasvsimon.com"
            }
        },
        {
            "id": "https://eliasvsimon.com/post/1633039200",
            "content_html": "<p><a href=\"https://ano-books.herokuapp.com/\"><strong>Visit ano-books</strong></a></p>\n<p>Ano Books is a full stack web app where anyone can create, edit, and delete a \"book\". It's a very concering and fundamentally flawed concept for sure, but it's very fun too!</p>\n<p>Instead of me explaining it here, <a href=\"https://ano-books.herokuapp.com/\">you should just check it out ;)</a></p>\n<p>Since this is more of a tech exercise than anything else, here's some of it</p>\n<ul>\n<li>React as frontend</li>\n<li>Express as backend</li>\n<li>Postgresql as database</li>\n</ul>\n<p><img src=\"/images/9-1.png\" title=\"Ano Books\"></p>\n<p>I want to look into a search feature, a filter option and maybe some oauth thing to toggle visibility or something. But for now it's a grand free for all</p>\n<p><a href=\"https://github.com/EliasVincent/ano-books\"><strong>Visit the repo</strong></a></p>\n<p>That's it for now, happy writing!</p>",
            "url": "https://eliasvsimon.com/post/1633039200",
            "title": "Introducing Ano Books - Create and Edits each other's Books!\r",
            "summary": "\r\n[**Visit ano-books**](https://ano-books.herokuapp.com/)\r\n\r\nAno Books is a full stack web app where anyone can create, edit, and",
            "image": "https://eliasvsimon.com/favicon-32x32.png",
            "date_modified": "2021-09-30T22:00:00.000Z",
            "author": {
                "name": "Elias\r",
                "url": "https://eliasvsimon.com"
            }
        },
        {
            "id": "https://eliasvsimon.com/post/1621029600",
            "content_html": "<p><a href=\"https://blog.catspace.xyz\"><strong>Visit catspace.xyz</strong></a></p>\n<p>Catspace.xyz is my new site with various services that are available to anyone for free!\nRight now, Catspace has</p>\n<ul>\n<li><a href=\"https://blog.catspace.xyz\">a Blog</a></li>\n<li><a href=\"https://git.catspace.xyz\">a Git Server</a></li>\n<li><a href=\"https://md.catspace.xyz\">an Online Markdown Editor</a></li>\n<li>and more to come!</li>\n</ul>\n<p>I'm trying to do a federated social media thing like Mastodon or Pleroma. Let's if I get it working or if it even makes sense at all.</p>\n<p>Expect services on Catspace to change rapidly, always look at the Blog to see what's available!</p>",
            "url": "https://eliasvsimon.com/post/1621029600",
            "title": "Catspace.xyz\r",
            "summary": "\r\n[**Visit catspace.xyz**](https://blog.catspace.xyz)\r\n\r\nCatspace.xyz is my new site with various services that are available to anyone for",
            "image": "https://eliasvsimon.com/favicon-32x32.png",
            "date_modified": "2021-05-14T22:00:00.000Z",
            "author": {
                "name": "Elias\r",
                "url": "https://eliasvsimon.com"
            }
        },
        {
            "id": "https://eliasvsimon.com/post/1599688800",
            "content_html": "<p>I've tried out Linux throughout the last couple of weeks and while I've found a replacement for pretty much every Windows-exclusive software, Microsoft To-Do is just really good. The closest thing to it is Todoist but I found it to be slow and unintuitive on all my devices. MS-Todo has a website version, but I've never been a big fan of using websites for everything, since you always lose some native functionalities like alt-tab and launching it from the start-menu.</p>\n<p><img src=\"/images/7-3.png\" title=\"Natively integrated thanks to Electron's .deb build function\"></p>\n<p>I knew that you could make web-apps feel and behave like native applications with the Electron framework, so I just set up an Electron App to launch a window accessing the MS-Todo website. It was a bit tricky at first to find the right configuration for the metadata and the icons, but now I think it works quite well.</p>\n<p><img src=\"/images/7-1.png\" title=\"Microsoft To-Do on Linux\"></p>\n<p>There are some drawbacks to this approach however. Since it's an Electron App, it bundles the full Chromium and NodeJS in addition to just the few lines I've written, making the application well over 100MB large. And since I've hardcoded the URL to MS-Todo, if Microsoft ever changes the URL, the app will become useless.</p>\n<p>So, if you're on Linux and still want to use Microsoft To-Do, there's an App for that now!</p>\n<p><a href=\"https://github.com/EliasVincent/ms-todo-electron-web-app\"><strong>Download on Github</strong></a></p>",
            "url": "https://eliasvsimon.com/post/1599688800",
            "title": "Microsoft To-Do for Linux - only a web wrapper, but still..\r",
            "summary": "\r\nI've tried out Linux throughout the last couple of weeks and while I've found a",
            "image": "https://eliasvsimon.com/favicon-32x32.png",
            "date_modified": "2020-09-09T22:00:00.000Z",
            "author": {
                "name": "Elias\r",
                "url": "https://eliasvsimon.com"
            }
        },
        {
            "id": "https://eliasvsimon.com/post/1596060000",
            "content_html": "<p>So, recently I've looked for a newer and better laptop, since I want to go to university in fall of this year and figured I would want a new laptop with a good screen and battery life, a touchscreen would be a nice bonus. The Surface Pro 7 did sound like a near perfect solution for me. The reviews largely praised it, though they mentioned only around 7 of the 10 advertised hours of battery life. I got the fanless i5/8GB RAM/128GB SSD version for around 900€ including keyboard, plus 70 for the pen. I own a lot of computers and gadgets, but this one is by far the most expensive item I own.\nThis rather subjective review will mainly focus on pain-points and things that were merely brushed over in other reviews I've found</p>\n<h2 id=\"looksanddesign\">Looks and Design</h2>\n<p>This thing really looks gorgeous. The design hasn't really changed since the Pro 4, but it's still a sleek and industrial design. The soft type cover really looks great as well. A nice bonus is that the silver color doesn't attract many visible fingerprints like a Thinkpad or an iPhone.</p>\n<p>It has a normal thickness for a tablet, and at the same time is ridiculously thin for a laptop, even with everything attached.</p>\n<h2 id=\"ergonomics\">Ergonomics</h2>\n<p>The Surface Pro 7 is quite a large tablet, which doesn't come through very well on a photo or video. It can be used as a normal tablet in theory, but you're only going to get a proper experience with the keyboard cover. The large kickstand and the magnetic cover hold the tablet in place very well, even on a more uneven surface it doesn't feel like it would fall off too easily. While you can use it on your lap, the screen won't be propped up as high as on a real laptop with a hinge. For short periods it's good enough though, and I'm writing this with my Surface on my lap. This thing is very protable and it's great.</p>\n<h2 id=\"keyboardpen\">Keyboard / Pen</h2>\n<p>This post is great for testing the keyboard, I've written the entire thing on the Surface.</p>\n<p>Though the keyboard is just a flat cover, the keyboard feels surprisingly amazing. It has a lot of travel, the keys are nice and large and it's backlit as well, really great.\nThe Surface Pen is very good as well. The button on the top is meant for quick-launching note applications, though they often don't register on my unit. The writing itself feels very smooth and the palm rejection works. It doubles as a mouse in Windows, which comes in handy for many small buttons and interfaces.</p>\n<h2 id=\"display\">Display</h2>\n<p>Apart from the other things, I really got lucky with the display. It's sharp and colorful. It has a very high max brightness, but remains rather dim until around 50% brightness or so.\nThere seem to be some display driver issues on the latest version. At least on my device, it seems to ignore user settings and always uses the default adaptive brightness thing. All Intel laptops have this option on by default and I don't know why, it's really irritating when it's changing the brightness based on the content. Hopefully that will get fixed soon.</p>\n<h2 id=\"performance\">Performance</h2>\n<p>I have the mid-range i5 processor and it handles basic tasks fast and without any issues, like all recent mid-range CPUs do. Even the quite demanding Visual Studio Code editor runs very well on it, it can handle front-end web-development with things like React, Electron and Node without any issues. Since it has no fan, the Surface can get quite warm most of the time. It's rarely too warm though, and since the keyboard is structurally independent from the device you never notice it when typing or, pun warning, when it's propped up on a Surface.\nWhile the Iris Plus integrated GPU is very capable of running fairly recent big titles, it will come to a halt rather quickly because of thermal throttling. So if you want to game, you also have to find games that have low enough requirenments to not stress it for long periods of time. I found that pretty much everything before 2008 and old emulators fall into that category. While it can still play a ton of great games, this is far from a gaming focused, or gaming capable laptop.</p>\n<h2 id=\"battery\">Battery</h2>\n<p>Microsoft claims around 10 hours of battery life under a test of light usage. That is a complete lie. Most people and reviews report around 6-7 hours of light usage with low brightness, anything more taxing drains it way more quickly. While I would've been okay with that, coming from a device with only around 3 hours of average usage, so far I get far worse results.\nWith 40% and below brightness (which is quite dark), almost no background applications and light web browsing on Microsoft's own Edge Browser, it struggles to get more than 5 hours of battery life. I've reinstalled firmware and other updates and tried to fully cycle through it a couple times as suggested by Microsoft themselves, but so far it's unimpressive and far below both Microsoft's and other users' claims. The standby is a hit or miss as well, either it uses no battery even when in standby for hours, or it drains it as if it was turned on. Other users reported this as well.</p>\n<p>Tweaks such as undervolting, restricting all kinds of background applications, forcing hibernation instead of standby do help quite a bit though, just like with any other laptop.</p>\n<p>But one good thing is the charger. It's magnetic and charges the Surface very quickly, even faster when in standby. The cable is very short though, but not much to complain here. It supports Type-C too and in theory powerbanks, but you need a very beefy and expensive power-delivery one to use it while turned on.</p>\n<h2 id=\"soundandnoise\">Sound and noise</h2>\n<p>The speakers are small but get decently loud. The speakers make an audible pop when something on Windows accesses sound, which is only noticeable in a quiet room. The headphone output sounds excellent though, no noise and very high quality, it's great.</p>\n<p><strong>Now here is my gripe with this thing so far.\nThe Surface Pro 7, or at least my unit, suffers a lot from coil whine. While I'm admittedly a bit sensitive and picky when it comes to noise, a lot of my devices have coil whine, like my X220 or some charging bricks. It's either never too loud or annoying or I can just unplug the bricks when not used.\nThis Surface however seems to be hit hard by it. When it's on and running, there's a crackling noise coming from the top side and the right side where the charging port is located. On top of that there's a high pitch, alternating whine, like that from a very bad charging brick, that's present even when in standby or completely turned off. At first I though I was going crazy, but I checked a lot during the past days and it's indeed coming from the Surface Pro 7. All of this seems to be amplified when charging. I'm pretty sure it's a defect, but many other user reports don't spark confidence in me thinking that a replacement could have the same issue. I was very excited for a fanless and silent Windows device, but so far it's not.</strong></p>\n<p>What makes it even funnier is that I've read a post about it shortly before I got my unit. Googling issues beforehand might be a bad omen.</p>\n<p>It doesn't help that Microsoft's support system (which you have to use if you get it from their store site) makes you jump through chatbots and hoops to actually talk to someone. I'm not sure what I'm gonna get from their under-warranty replacement service and how long it's gonna take, becuase of Corona and all that.</p>\n<p>And while I could live with that alone, who knows what else might be wrong with this one. I might also be just extremely paranoid with this thing.</p>\n<h2 id=\"comparsiontothinkpadx250\">Comparsion to Thinkpad X250</h2>\n<p>This device is meant as an Upgrade to my Thinkpad X250. It has a Broadwell i5, 8GB RAM, and upgraded SSD and a replaced IPS panel. It doesn't to have fully survived the later, as the allegedly compatible panel doesn't leave enough room for the bottom bezel clips to close and sit flush. I partially fixed it with holding it with special tape on the bottom, but it admittedly doesn't look very confident. While only costing around 300€ including all the upgrades, it compares shockingly well to the Surface Pro 7. Light tasks perform identically, although the Surface has that bit more oopmh to handle Editors and IDEs properly.\nBattery life is disappointingly similar, but I could replace the batteries on the X250 with newer or even larger ones, over time the Surface's battery life will only go in one direction.</p>\n<p>However looks, ergonomics, the screen, the input, the overall snappiness, the accessories, the headphone port and all that are on another league on Surface of course. If it wouldn't be for the probable defects on mine and it would be like reviewers said, this 1000€ laptop would be obviously way way better than a 300€ laptop.</p>\n<p>In terms of upgradability they're on two extreme ends. While almost everything on the Thinkpad is replacable, the Surface is glued shut and even things like the SSD and the RAM are soldered to the motherboard. If any of them fail, it's game over for this expensive machine.</p>\n<h2 id=\"price\">Price</h2>\n<p>This thing is of course not meant to be priced competitively, mainly becuase Microsoft doesn't want to compete with their own partners like Dell and HP, which sell way more Windows devices than the Surface line ever will. It starts with an i3/4GB RAM but that model doesn't make any sense, the \"real model\" starts at around 900€. If you want to double the storage to 256GB, you have to pay well over 200€ for that, even more for more RAM or an i7, that's beyond overpriced and just comical. Plus you always have to add around 150€ in your head for keyboard and pen (you can get very good used laptops for that kind of money, here you only get the essential accessories that should've been included from the get-go). Add the fact that the thing will always be \"as is\", and pretty much nothing being replacable or even repairable, the price is tough pill to swallow. I got a good deal, getting the Type Cover for free in a bundle. With that, the base i5 model is actually quite competitive to other 2-in-1s.</p>\n<p>But Surface devices hold on to their value rather well though. Either you can resell it for a very good price, or for scraps when anything on the device is broken.</p>\n<p>Microsoft's own online store has a generous 30 day return policy. However I would still recommend to buy it from Amazon for their easier return and support systems, unless you really like dealing with chatbots all day.</p>\n<h2 id=\"verdict\">Verdict</h2>\n<p>I really liked the Surface Pro 7 for the week I've had it. The versatility, the screen, the pen and so on are unmatched and is one of the best and most portable Windows devices out there, while still giving a full, uncompromised experience.</p>\n<p>Sure my unit had some issues like the weird coile whine, but even without that, it still has some shortcomings for me that just don't seem right for a device of this price class. The subpar, less than half of advertised battery life and not being able to repair if any of the fragile parts break leave me quite anxious when I carry it around. I would try to get mine replaced, but I can't seem to do it with the Microsoft Store support system, so I will instead opt for a refund.</p>\n<p>My studying stuff is still a couple more months away, with most of it probably being done online. This will still give me plenty of time to play around with my X250 and maybe looking out for other laptops, I mean all they can do is release better products in the future. Some promising looking things are Ryzen processors and even Apple's future ARM based MacBooks sound very interesting.</p>",
            "url": "https://eliasvsimon.com/post/1596060000",
            "title": "Surface Pro 7 Review\r",
            "summary": "So, recently I've looked for a newer and better laptop, since I want to go",
            "image": "https://eliasvsimon.com/favicon-32x32.png",
            "date_modified": "2020-07-29T22:00:00.000Z",
            "author": {
                "name": "Elias\r",
                "url": "https://eliasvsimon.com"
            }
        },
        {
            "id": "https://eliasvsimon.com/post/1593986400",
            "content_html": "<p>Me and SoulPixel participated in the <a href=\"https://itch.io/jam/godot-wild-jam-22\">Godot Wild Jam #22</a>. The theme of the jam was \"Revolution\", so we came up with an arcade-strategy game called Perestroika.</p>\n<h2 id=\"thegame\">The Game</h2>\n<p>You have to gather a crowd around you. Your followers will give you FAME. With your FAME you can acquire even more followers!</p>\n<p>But be careful. The red people, they will try to throw you and your followers over!\nYour followes can also slowly turn into red people, cheer them on from time to time.\nStanding behind the red flag will give you a lot of FAME, but beware, they're a hot-spot for the red people!\nHow many followers can you gain before the time runs out?</p>\n<h2 id=\"play\">Play</h2>\n<iframe src=\"https://itch.io/embed/677649?dark=true\" width=\"208\" height=\"167\" frameborder=\"0\"><a href=\"https://riesyeti.itch.io/perestroika\">Perestroika by Riesyeti</a></iframe>",
            "url": "https://eliasvsimon.com/post/1593986400",
            "title": "Perestroika, Gamejam game together with SoulPixel\r",
            "summary": "\r\nMe and SoulPixel participated in the [Godot Wild Jam #22](https://itch.io/jam/godot-wild-jam-22). The theme of the jam",
            "image": "https://eliasvsimon.com/favicon-32x32.png",
            "date_modified": "2020-07-05T22:00:00.000Z",
            "author": {
                "name": "Elias\r",
                "url": "https://eliasvsimon.com"
            }
        },
        {
            "id": "https://eliasvsimon.com/post/1593727200",
            "content_html": "<p>I released Catformer, my first game ever. It's made with the Godot Game Engine. </p>\n<p>It's a 2D Platformer where you play as a ball-shaped cat and have to save the moon from losing all it's shine.</p>\n<p>The game is, obviously, far from perfect and has a lot of issues.</p>\n<p>Trailer:</p>\n<iframe width=\"280\" height=\"157\" src=\"https://www.youtube-nocookie.com/embed/GZ-7jcGK_hc\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>\n<p><a href=\"https://riesyeti.itch.io/catformer\">Play in Browser / Download for Windows, Mac and Linux</a></p>",
            "url": "https://eliasvsimon.com/post/1593727200",
            "title": "Catformer, my first ever game\r",
            "summary": "\r\nI released Catformer, my first game ever. It's made with the Godot Game Engine. \r\n\r\nIt's",
            "image": "https://eliasvsimon.com/favicon-32x32.png",
            "date_modified": "2020-07-02T22:00:00.000Z",
            "author": {
                "name": "Elias\r",
                "url": "https://eliasvsimon.com"
            }
        },
        {
            "id": "https://eliasvsimon.com/post/1593640800",
            "content_html": "<p>First post, hello there!</p>",
            "url": "https://eliasvsimon.com/post/1593640800",
            "title": "First Post on evs blog!\r",
            "summary": "\r\nFirst post, hello there!",
            "image": "https://eliasvsimon.com/favicon-32x32.png",
            "date_modified": "2020-07-01T22:00:00.000Z",
            "author": {
                "name": "Elias\r",
                "url": "https://eliasvsimon.com"
            }
        }
    ]
}