[{"id":1594159200,"title":"New interactive Post-Creator\r","author":"Elias\r","date":"July 8 2020\r","content":"\r\nHello there again\r\n\r\n🕘🕝🕗Aaall the way back in February I've already tried to make a React website, but ultimately it failed due to lack of direction and upcoming school work. But in that project I had this idea, that visitors could create their own \"boxes\" in a form text field, and it would instantly turn into one of those weird stylized \"boxes\" I had in the old version of this website:\r\n\r\n<img src=\"/images/image-post-4.png\" title=\"yeah, that one was weird..\">\r\n\r\n***\r\n\r\nNow, I've taken some of that and made a sort-of post-creator for this website 📑. [Scroll down the main homepage to access it or **click here.**](/) There you can input any text you want, it also supports Markdown syntax, since the text gets passed into a React-Markdown module.\r\n\r\n"},{"id":1593986400,"title":"Perestroika, Gamejam game together with SoulPixel\r","author":"Elias\r","date":"July 6 2020\r","content":"\r\nMe and SoulPixel participated in the [Godot Wild Jam #22](https://itch.io/jam/godot-wild-jam-22). The theme of the jam was \"Revolution\", so we came up with an arcade-strategy game called Perestroika.\r\n\r\n## The Game\r\n\r\nYou have to gather a crowd around you. Your followers will give you FAME. With your FAME you can acquire even more followers!\r\n\r\nBut be careful. The red people, they will try to throw you and your followers over!\r\nYour followes can also slowly turn into red people, cheer them on from time to time.\r\nStanding behind the red flag will give you a lot of FAME, but beware, they're a hot-spot for the red people!\r\nHow many followers can you gain before the time runs out?\r\n\r\n## Play\r\n\r\n<iframe src=\"https://itch.io/embed/677649?dark=true\" width=\"208\" height=\"167\" frameborder=\"0\"><a href=\"https://riesyeti.itch.io/perestroika\">Perestroika by Riesyeti</a></iframe>"},{"id":1593727200,"title":"Catformer, my first ever game\r","author":"Elias\r","date":"July 3 2020\r","content":"\r\nI released Catformer, my first game ever. It's made with the Godot Game Engine. \r\n\r\nIt's a 2D Platformer where you play as a ball-shaped cat and have to save the moon from losing all it's shine.\r\n\r\nThe game is, obviously, far from perfect and has a lot of issues.\r\n\r\nTrailer:\r\n<iframe width=\"280\" height=\"157\" src=\"https://www.youtube-nocookie.com/embed/GZ-7jcGK_hc\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>\r\n\r\n[Play in Browser / Download for Windows, Mac and Linux](https://riesyeti.itch.io/catformer)"},{"id":1593640800,"title":"First Post on evs blog!\r","author":"Elias\r","date":"July 2 2020\r","content":"\r\nFirst post, hello there!"}]